{
  "weeks": {
    "1": {
      "size": {
        "fruit": "Насінина маку",
        "description": "Крихітна клітина, невидима неозброєним оком"
      },
      "baby_development": "Відбувається запліднення яйцеклітини та початок клітинного ділення. Запліднена яйцеклітина (зигота) подорожує маткою до місця імплантації.",
      "mother_changes": "Жодних помітних змін на даному етапі. Гормональні зміни ще не почалися, тому симптоми вагітності відсутні.",
      "nutrition_tips": "Почніть приймати фолієву кислоту (400 мкг щодня) для запобігання дефектам нервової трубки. Збалансоване харчування з достатньою кількістю білків, заліза та кальцію.",
      "weight": "менше 1 г",
      "length": "0.1-0.2 мм"
    },
    "2": {
      "size": {
        "fruit": "Насінина кунжуту",
        "description": "Маленьке скупчення клітин, що активно діляться"
      },
      "baby_development": "Зародок (бластоциста) імплантується в стінку матки. Починається формування плаценти, амніотичного мішка та жовткового мішка, які забезпечуватимуть плід киснем та поживними речовинами.",
      "mother_changes": "Можливі перші ознаки вагітності: підвищена втомлюваність, чутливість грудей, легка нудота. Багато жінок ще не підозрюють про вагітність.",
      "nutrition_tips": "Продовжуйте приймати фолієву кислоту. Зменшіть споживання кофеїну до 200 мг на день. Пийте достатню кількість води (8-10 склянок щодня).",
      "weight": "менше 1 г",
      "length": "0.2-0.3 мм"
    },
    "3": {
      "size": {
        "fruit": "Насінина кмину",
        "description": "Ембріон починає формуватися"
      },
      "baby_development": "Формується хордовий мішок - основа для майбутнього хребта. З'являється нервова трубка - зачаток нервової системи та головного мозку. Починається формування первинних клітин крові та кровоносних судин.",
      "mother_changes": "Часте сечовипускання через гормональні зміни. Можлива затримка менструації, що часто стає першою ознакою вагітності. Посилена втома та сонливість через підвищений рівень прогестерону.",
      "nutrition_tips": "Включіть у раціон джерела омега-3 жирних кислот (лосось, волоські горіхи) для розвитку мозку дитини. Уникайте сирого м'яса та непастеризованих молочних продуктів.",
      "weight": "менше 1 г",
      "length": "0.4-0.5 мм"
    },
    "4": {
      "size": {
        "fruit": "Макове зернятко",
        "description": "Ембріон схожий на крихітну рисову зернину"
      },
      "baby_development": "Починається формування усіх основних органів: серця, легень, шлунка, печінки та нирок. Серце починає битися і можна виявити його пульсацію на УЗД. Формуються зачатки очей, вух, рота та щелеп.",
      "mother_changes": "Набряк та болючість грудей через гормональні зміни. Можлива ранкова нудота, яка може тривати протягом дня. Зміна смаків та відраза до певних запахів.",
      "nutrition_tips": "Збільшіть споживання продуктів, багатих на залізо (шпинат, сочевиця, червоне м'ясо) для профілактики анемії. Їжте малими порціями але частіше, щоб зменшити нудоту.",
      "weight": "менше 1 г",
      "length": "0.8-1.0 мм"
    },
    "5": {
      "size": {
        "fruit": "Насінина апельсина",
        "description": "Ембріон починає набувати С-подібної форми"
      },
      "baby_development": "Формуються ручки та ніжки, які мають вигляд крихітних бруньок. Починається розвиток очей з пігментом. Формується пуповина, яка з'єднує ембріон з плацентою. Продовжує розвиватися серце, яке вже поділене на камери.",
      "mother_changes": "Посилення нудоти та блювання, особливо зранку. Загострення нюху, що може посилювати нудоту. Можливі перепади настрою через гормональні зміни.",
      "nutrition_tips": "Вживайте імбир (чай, печиво) для зменшення нудоти. Забезпечте достатнє споживання білка (75-100 г щодня) для підтримки росту тканин дитини та плаценти.",
      "weight": "менше 1 г",
      "length": "1.5-2.5 мм"
    },
    "6": {
      "size": {
        "fruit": "Сочевиця",
        "description": "Ембріон активно росте та формується"
      },
      "baby_development": "Формується обличчя: очі чіткіше видно, з'являються ніздрі та рот. Продовжується розвиток внутрішніх органів. Формуються зачатки легень. Розвиваються кінцівки, з'являються кисті та стопи.",
      "mother_changes": "Посилення симптомів раннього терміну (нудота, втома). Часте сечовипускання через збільшення розмірів матки. Можливі запори через вплив гормонів на травний тракт.",
      "nutrition_tips": "Додайте джерела кальцію (молочні продукти, збагачені рослинні напої, темно-зелені листові овочі) для формування скелету дитини. Пийте трав'яні чаї (ромашковий, м'ятний) для зменшення нудоти.",
      "weight": "менше 1 г",
      "length": "4-6 мм"
    },
    "7": {
      "size": {
        "fruit": "Чорниця",
        "description": "Голова дитини становить майже половину довжини тіла"
      },
      "baby_development": "Швидко розвиваються мозок та нервова система. Формуються повіки, які закривають очі. Ніс та губи стають більш оформленими. Розвиваються пальці на руках і ногах. Продовжується формування внутрішніх органів.",
      "mother_changes": "Збільшення виділень з піхви через посилений кровообіг. Початок росту матки, хоча живіт ще не помітний. Можливі головні болі через гормональні коливання та зміни кровообігу.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на цинк (м'ясо, морепродукти, насіння) для підтримки імунної системи. Уникайте надмірного споживання вітаміну А, який може бути шкідливим для плоду.",
      "weight": "близько 1 г",
      "length": "7-9 мм"
    },
    "8": {
      "size": {
        "fruit": "Малина",
        "description": "Маленький ембріон вже з помітними зачатками органів"
      },
      "baby_development": "Формуються всі основні органи, розвиваються очі, вуха, серце почало битися. Плід починає рухатися, хоча мама ще не відчуває цих рухів. З'являються характерні риси обличчя. Кінцівки стають довшими, з'являються суглоби.",
      "mother_changes": "Збільшення грудей, можливо ранкова нудота, втома, часте сечовипускання. Матка розміром з м'яч для гольфу. Можлива поява судом в ногах через зміни в мінеральному балансі.",
      "nutrition_tips": "Збагатіть раціон білками, кальцієм і фолієвою кислотою. Вживайте продукти, багаті на магній (горіхи, цільнозернові продукти) для запобігання судомам у ногах.",
      "weight": "близько 1 г",
      "length": "1.6 см"
    },
    "9": {
      "size": {
        "fruit": "Виноградина",
        "description": "Плід вже більше схожий на маленьку людину"
      },
      "baby_development": "Ембріон офіційно стає плодом. Формуються статеві органи, хоча стать ще неможливо визначити на УЗД. Продовжується розвиток м'язів. Нирки починають функціонувати та виробляти сечу. Починає формуватися скелет з хрящів.",
      "mother_changes": "Можливе незначне збільшення ваги. Вени на грудях стають більш помітними через посилений кровообіг. Зменшення нудоти у деяких жінок. Можлива поява вугрів через гормональні зміни.",
      "nutrition_tips": "Збільшіть вживання продуктів, багатих вітаміном D (жирна риба, яйця) для формування скелету дитини. Забезпечте достатнє споживання йоду (морепродукти, йодована сіль) для розвитку мозку.",
      "weight": "2-3 г",
      "length": "2.3-2.5 см"
    },
    "10": {
      "size": {
        "fruit": "Оливка",
        "description": "Плід продовжує інтенсивно рости і розвиватися"
      },
      "baby_development": "Закінчується найбільш критичний період розвитку органів. Формуються нігті на пальцях рук і ніг. Починає розвиватися плацента, поступово перебираючи функцію жовточного мішка. Плід активно рухається у матці.",
      "mother_changes": "Зменшення симптомів раннього терміну у деяких жінок. Можлива поява легкого округлення живота, особливо у жінок, які народжують не вперше. Збільшення апетиту. Зміни настрою стають менш вираженими.",
      "nutrition_tips": "Вживайте продукти, багаті на хром (цільнозернові продукти, броколі, яблука) для підтримки рівня цукру в крові. Збільшіть споживання продуктів з високим вмістом антиоксидантів (ягоди, горіхи) для захисту клітин від пошкоджень.",
      "weight": "5-8 г",
      "length": "3.1-3.5 см"
    },
    "11": {
      "size": {
        "fruit": "Інжир",
        "description": "Голова все ще непропорційно велика відносно тіла"
      },
      "baby_development": "Плід починає ковтати та виділяти амніотичну рідину, що допомагає розвивати травну систему. Формуються голосові зв'язки. Нирки починають виробляти сечу, яка виділяється в амніотичну рідину. На кінчиках пальців з'являються унікальні відбитки.",
      "mother_changes": "Матка досягає розміру грейпфрута і починає підніматися з тазової області. Зникнення або значне зменшення нудоти. Збільшення енергії та покращення настрою. Можлива поява перших розтяжок.",
      "nutrition_tips": "Включіть у раціон продукти, багаті вітаміном C (цитрусові, ківі, перець) для покращення засвоєння заліза та підтримки імунної системи. Вживайте продукти з пробіотиками для здорової мікрофлори кишечника.",
      "weight": "10-14 г",
      "length": "4.1-4.5 см"
    },
    "12": {
      "size": {
        "fruit": "Лайм",
        "description": "Плід вже має чіткі людські обриси"
      },
      "baby_development": "Сформовані всі органи, починають рости нігті, плід може рухати кінцівками. Мозок продовжує розвиватися, нейрони формують складні зв'язки. Кишечник переміщується з пуповини в черевну порожнину. Починає функціонувати щитоподібна залоза.",
      "mother_changes": "Зменшення нудоти, поява апетиту, невелике збільшення живота. Зникнення втоми першого триместру. Можлива поява шкірної пігментації (хлоазма, лінія на животі). Збільшення виділень з піхви через посилений кровообіг.",
      "nutrition_tips": "Включіть у раціон більше овочів і фруктів для отримання вітамінів. Забезпечте достатнє споживання йоду (морепродукти, йодована сіль) для функціонування щитоподібної залози дитини.",
      "weight": "14-20 г",
      "length": "5-6 см"
    },
    "13": {
      "size": {
        "fruit": "Персик",
        "description": "Плід активно розвиває мускулатуру"
      },
      "baby_development": "Завершення формування зовнішніх статевих органів - на УЗД вже можна визначити стать. Плід може смоктати палець. Розвивається підшкірний жир. Формується мімічна мускулатура - плід може хмуритися та гримасувати.",
      "mother_changes": "Завершення першого триместру - зниження ризику викидня. Живіт починає округлюватися, особливо у жінок, які народжують не вперше. Стабілізація емоційного стану. Покращення стану шкіри та волосся завдяки гормонам вагітності.",
      "nutrition_tips": "Вживайте більше продуктів, багатих на цинк (м'ясо, морепродукти, насіння) для підтримки імунітету. Пам'ятайте про достатнє споживання вітаміну D, особливо в зимовий період, коли менше сонячного світла.",
      "weight": "23-28 г",
      "length": "7-8 см"
    },
    "14": {
      "size": {
        "fruit": "Лимон",
        "description": "Пропорції тіла стають більш збалансованими"
      },
      "baby_development": "Починається формування меконію (першого випорожнення) в кишечнику. Розвиваються м'язи обличчя, що дозволяє плоду змінювати вираз обличчя. Починає функціонувати імунна система. Очі закриті, але плід може реагувати на світло.",
      "mother_changes": "Початок другого триместру - 'золотого періоду' вагітності. Поява енергії та бадьорості. Живіт стає помітнішим. Можлива поява болю в спині та кругових зв'язках матки через її ріст. Посилення апетиту.",
      "nutrition_tips": "Збільшіть споживання білків (75-100 г щодня) для підтримки росту м'язової маси дитини. Включіть у раціон продукти з хорошими жирами (авокадо, горіхи, оливкова олія) для розвитку нервової системи плоду.",
      "weight": "35-45 г",
      "length": "8.5-9 см"
    },
    "15": {
      "size": {
        "fruit": "Яблуко",
        "description": "Плід набуває більш пропорційного вигляду"
      },
      "baby_development": "Починають розвиватися потові залози. Скелет продовжує осифікацію - хрящі перетворюються на кістки. Шкіра ще дуже тонка і прозора, через неї видно кровоносні судини. Починає формуватися тонке волосся (лануго) по всьому тілу.",
      "mother_changes": "Збільшення об'єму крові досягає 40-50% від початкового. Можливі носові кровотечі та закладеність носа через набряк слизових оболонок. Поява болю в спині через зміну центру тяжіння. Потемніння ареол грудей.",
      "nutrition_tips": "Споживайте продукти, багаті на кальцій (молочні продукти, мигдаль, насіння чіа) для формування скелету дитини. Вживайте достатньо клітковини (цільнозернові продукти, фрукти, овочі) для запобігання запорам.",
      "weight": "70-85 г",
      "length": "10-11 см"
    },
    "16": {
      "size": {
        "fruit": "Авокадо",
        "description": "Плід активно росте і розвивається"
      },
      "baby_development": "Формуються риси обличчя, шкіра стає менш прозорою, починають рости волосся. Плід вже може чути звуки ззовні - голос матері, музику. Очі можуть сприймати світло, хоча повіки все ще закриті. Активно розвивається мозок.",
      "mother_changes": "Помітний живіт, можливо відчуття перших рухів дитини, збільшення енергії. Можлива поява темної лінії (linea nigra) від лобка до пупка. Збільшення кількості крові та рідини в організмі, що може спричинити набряки.",
      "nutrition_tips": "Збільшіть споживання білків і кальцію для розвитку м'язів і кісток дитини. Вживайте продукти, багаті на вітамін Е (горіхи, насіння, рослинні олії) для здоров'я шкіри та розвитку нервової системи.",
      "weight": "100-120 г",
      "length": "10-12 см"
    },
    "17": {
      "size": {
        "fruit": "Груша",
        "description": "Плід активно накопичує жирову тканину"
      },
      "baby_development": "Розвиваються сальні залози, які вироблятимуть первородну змазку (vernix caseosa) для захисту шкіри. Посилюються рухи плоду, формується координація. Починає розвиватися підшкірний жир. У дівчаток матка і яєчники вже сформовані.",
      "mother_changes": "Більшість жінок вже відчуває рухи дитини. Збільшення ваги стає помітнішим. Можливе виникнення або посилення закрепів. Матка піднімається вище, зменшуючи тиск на сечовий міхур, але можливе виникнення печії.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на залізо (червоне м'ясо, шпинат, сочевиця) для запобігання анемії. Вживайте продукти з високим вмістом фосфору (риба, яйця, молочні продукти) для формування кісток і зубів.",
      "weight": "140-160 г",
      "length": "12-13 см"
    },
    "18": {
      "size": {
        "fruit": "Солодка картопля",
        "description": "Плід стає більш пропорційним і набуває ваги"
      },
      "baby_development": "Формуються сенсорні шляхи для п'яти основних почуттів. Продовжується розвиток мозку та нервової системи. Починає формуватися постійна система кровообігу. Кишечник починає накопичувати меконій - перші випорожнення.",
      "mother_changes": "Може з'явитися болючість і кровоточивість ясен. Збільшення живота змінює центр тяжіння, що може спричинити біль у спині. Можливі головні болі через гормональні зміни та збільшення об'єму крові. Рухи дитини стають більш відчутними.",
      "nutrition_tips": "Вживайте продукти, багаті на вітамін К (зелені листові овочі, брокколі) для здорового згортання крові. Збільшіть споживання продуктів, багатих на вітамін А (морква, гарбуз, батат) для розвитку органів зору.",
      "weight": "190-210 г",
      "length": "14-15 см"
    },
    "19": {
      "size": {
        "fruit": "Манго",
        "description": "Тіло вкрите захисним шаром первородної змазки"
      },
      "baby_development": "Починає формуватися постійний шаблон сну і неспання. Розвивається координація рухів. Шкіра вкривається первородною змазкою (vernix caseosa) та лануго (тонким волоссям) для захисту. Активно розвиваються легені, готуючись до дихання.",
      "mother_changes": "Збільшення розміру і ваги живота. Виражені рухи дитини, які можуть відчуватися як поштовхи або перевороти. Можливі болі в спині та тазу через ослаблення зв'язок. Поява або посилення набряків ніг і рук.",
      "nutrition_tips": "Споживайте продукти, багаті на вітамін В6 (птиця, картопля, банани) для нормального функціонування нервової системи. Вживайте продукти з вмістом магнію (шпинат, горіхи, цільнозернові продукти) для запобігання судомам м'язів.",
      "weight": "240-260 г",
      "length": "15-16 см"
    },
    "20": {
      "size": {
        "fruit": "Банан",
        "description": "Плід активно рухається і реагує на звуки"
      },
      "baby_development": "Формуються смакові рецептори, вуха зайняли своє постійне положення, плід має періоди сну і активності. Шкіра вже не така прозора, але все ще червонувата через видимі кровоносні судини. Починають рости нігті та брови. На УЗД можна чітко визначити стать дитини.",
      "mother_changes": "Активні рухи дитини, збільшення живота, поява растяжок. Збільшення виробництва молозива в грудях. Матка досягає рівня пупка. Шкіра живота може свербіти через розтягнення. Можливе виникнення гемороїдів через тиск матки.",
      "nutrition_tips": "Збільшіть споживання омега-3 жирних кислот (жирна риба, лляне насіння, волоські горіхи) для розвитку мозку дитини. Забезпечте достатнє споживання вітаміну С для формування колагену та здоров'я шкіри.",
      "weight": "250-300 г",
      "length": "16-18 см"
    },
    "21": {
      "size": {
        "fruit": "Морква",
        "description": "Плід міцнішає і продовжує набирати вагу"
      },
      "baby_development": "Мозок та нервова система продовжують активно розвиватися. Плід ковтає амніотичну рідину, яка проходить через травну систему. Еритроцити починають вироблятися в кістковому мозку замість печінки. Формуються чіткі цикли сну і активності.",
      "mother_changes": "Збільшення живота та матки, яка тепер досягає рівня на 2 см вище пупка. Поява болю у спині через зміну постави та розтягнення зв'язок. Зміна центру тяжіння може спричиняти незграбність. Можлива поява розтяжок.",
      "nutrition_tips": "Забезпечте достатнє споживання вітаміну B12 (м'ясо, яйця, молочні продукти) для здорового кровотворення. Вживайте продукти, багаті на холін (яйця, м'ясо, цвітна капуста) для нормального розвитку мозку дитини.",
      "weight": "320-350 г",
      "length": "18-19 см"
    },
    "22": {
      "size": {
        "fruit": "Папайя",
        "description": "Обличчя плоду набуває дедалі більш виразних рис"
      },
      "baby_development": "Повіки та брови повністю сформовані. Нігті досягають кінчиків пальців рук. Панкреатична система починає виробляти інсулін. Активно розвиваються органи чуття, плід може відчувати дотик та реагувати на звуки.",
      "mother_changes": "Виражені рухи плоду, які може відчувати не лише мама, але й інші люди, приклавши руку до живота. Збільшення маси тіла, особливо у живота та грудей. Можлива задишка при фізичних навантаженнях через тиск на діафрагму.",
      "nutrition_tips": "Збільшіть споживання продуктів з цинком (м'ясо, насіння, бобові) для здорового розвитку імунної системи. Вживайте продукти, багаті на вітамін Е (горіхи, насіння, шпинат) для здоров'я клітинних мембран.",
      "weight": "380-400 г",
      "length": "20-21 см"
    },
    "23": {
      "size": {
        "fruit": "Помідор",
        "description": "Шкіра плоду стає менш прозорою і набуває рожевого відтінку"
      },
      "baby_development": "Обличчя плоду повністю сформоване, включаючи брови та повіки. Кровоносні судини в легенях починають розвиватися для підготовки до дихання. Шкіра морщиниста, червонувата і покрита захисним шаром. Плід вже реагує на голос матері.",
      "mother_changes": "Збільшення маси тіла стає більш помітним. Схильність до запаморочень через зниження артеріального тиску. Посилення виділень з піхви через збільшення кровотоку. Збільшення розміру ступень і щиколоток через набряки.",
      "nutrition_tips": "Вживайте продукти, багаті на вітамін D (жирна риба, яйця, збагачені молочні продукти) для здорового формування кісток. Забезпечте достатнє споживання йоду для нормального функціонування щитоподібної залози.",
      "weight": "450-500 г",
      "length": "22-23 см"
    },
    "24": {
      "size": {
        "fruit": "Кукурудза",
        "description": "Тіло дитини наповнюється і формуються пропорції"
      },
      "baby_development": "Легені готуються до дихання, плід має періоди активності і спокою, може чути голос мами. Шкірний покрив все ще тонкий, але стає менш прозорим. Починає накопичуватися підшкірний жир. У дівчаток формуються яєчники з яйцеклітинами.",
      "mother_changes": "Збільшення ваги, біль у спині, набряки ніг, болі в животі від розтягнення м'язів. Можлива поява варикозного розширення вен через збільшений тиск на кровоносні судини. Живіт продовжує рости, матка досягає рівня на 4-5 см вище пупка.",
      "nutrition_tips": "Споживайте достатню кількість заліза, щоб запобігти анемії. Забезпечте надходження магнію (горіхи, цільнозернові продукти, темний шоколад) для зниження ризику передчасних пологів.",
      "weight": "550-600 г",
      "length": "28-30 см"
    },
    "25": {
      "size": {
        "fruit": "Цвітна капуста",
        "description": "Плід активно накопичує жир і набирає вагу"
      },
      "baby_development": "Повний розвиток спинного мозку. Респіраторна система продовжує розвиватися, утворюються альвеоли в легенях. Плід активно набирає вагу. На УЗД можна побачити, що плід стискає кулачки і смокче палець.",
      "mother_changes": "Ниючі болі у спині та тазу через збільшення матки та розтягнення зв'язок. Поява гемороїдів через збільшений тиск на вени. Розвиток кругової вени (збільшена вена навколо пупка) через розширення судин живота.",
      "nutrition_tips": "Збільшіть споживання кальцію для розвитку скелету дитини. Вживайте продукти, багаті на вітамін K (зелені листові овочі) для нормального згортання крові.",
      "weight": "650-700 г",
      "length": "33-35 см"
    },
    "26": {
      "size": {
        "fruit": "Кабачок",
        "description": "Плід виглядає худішим, але набирає вагу"
      },
      "baby_development": "Ноздрі відкриваються, дозволяючи практикувати дихальні рухи. Очі повністю сформовані і починають відкриватися. Мозок швидко розвивається, формуються борозни і звивини. Плід реагує на світло та звуки з зовнішнього світу.",
      "mother_changes": "Збільшення апетиту через зростаючі потреби в енергії. Живіт продовжує рости, можлива поява 'хибних перейм' (скорочення Брекстона-Гікса). Збільшення виробництва молозива. Свербіж шкіри живота.",
      "nutrition_tips": "Вживайте продукти, багаті на омега-3 жирні кислоти для розвитку мозку дитини. Збільшіть споживання клітковини для запобігання запорам і підтримки здорової мікробіоти кишечника.",
      "weight": "750-800 г",
      "length": "35-36 см"
    },
    "27": {
      "size": {
        "fruit": "Броколі",
        "description": "Тіло стає більш пропорційним"
      },
      "baby_development": "Нервова система достатньо розвинена для регулювання температури тіла. Плід може відкривати і закривати очі, а також розпізнавати деякі звуки. Мозок продовжує активно розвиватися. Легені виробляють сурфактант для запобігання спаданню після народження.",
      "mother_changes": "Завершення другого триместру. Посилення болей у спині та тазу. Збільшення частоти сечовипускання через тиск матки на сечовий міхур. Можлива поява болю у правому верхньому квадранті живота через розтягнення печінки.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на вітамін C для підтримки імунної системи і покращення засвоєння заліза. Вживайте продукти з протеїнами високої якості для розвитку органів і тканин дитини.",
      "weight": "850-900 г",
      "length": "36-37 см"
    },
    "28": {
      "size": {
        "fruit": "Баклажан",
        "description": "Плід активно набирає вагу"
      },
      "baby_development": "Відкриваються очі, розвивається мозок, легені продовжують розвиватись. Плід може розрізняти світло і темряву, реагувати на гучні звуки. Якщо дитина народиться на цьому терміні, у неї є добрі шанси на виживання з медичною допомогою.",
      "mother_changes": "Задишка, печія, набряки, можливі болі в тазу. Збільшення розміру матки зміщує внутрішні органи, що може призводити до дискомфорту. Пупок може виступати назовні. Збільшення кількості вагітнісних снів і тривог.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на вітамін D і магнієм. Забезпечте достатнє споживання білка (близько 75-100 г щодня) для підтримки росту дитини.",
      "weight": "900-1000 г",
      "length": "35-37 см"
    },
    "29": {
      "size": {
        "fruit": "Гарбуз",
        "description": "Плід активно набирає вагу і готується до народження"
      },
      "baby_development": "Мозок здатний регулювати температуру тіла і контролювати периферичну циркуляцію. Кістки стають повністю сформованими, хоча все ще м'якими. Плід активно набирає вагу, підшкірний жир продовжує накопичуватися. Імунна система розвивається.",
      "mother_changes": "Значне збільшення ваги. Посилення болів у спині, тазу та суглобах. Скорочення Брекстона-Гікса стають більш частими. Задишка через тиск на діафрагму. Підвищена втомлюваність через додаткове навантаження.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на залізо для запобігання анемії. Продовжуйте вживати достатню кількість кальцію для розвитку скелету дитини та запобігання дефіциту у матері.",
      "weight": "1.1-1.2 кг",
      "length": "38-39 см"
    },
    "30": {
      "size": {
        "fruit": "Капуста",
        "description": "Шкіра стає гладкішою, оскільки плід накопичує жир"
      },
      "baby_development": "Плід активно набирає вагу. Продовжується розвиток мозку — формуються мільярди нейронів. Легені майже повністю розвинені, хоча все ще потребують дозрівання. Очі здатні фокусуватися. Плід реагує на світло, звук і дотик.",
      "mother_changes": "Матка досягає рівня між пупком і грудною кліткою. Збільшення виділень з піхви через підготовку до пологів. Часте сечовипускання через тиск на сечовий міхур. Можливе набрякання обличчя, особливо зранку.",
      "nutrition_tips": "Включіть у раціон продукти, багаті на залізо для підтримки збільшеного об'єму крові. Вживайте продукти з високим вмістом аргініну (горіхи, насіння, бобові) для покращення кровообігу.",
      "weight": "1.3-1.4 кг",
      "length": "39-40 см"
    },
    "31": {
      "size": {
        "fruit": "Кокос",
        "description": "Плід швидко набирає вагу для підготовки до народження"
      },
      "baby_development": "Центральна нервова система набуває здатності контролювати дихання та температуру тіла. Швидко розвивається сітківка очей, плід може простежувати світло. Нирки повністю сформовані. Плід робить дихальні рухи, щоб тренувати легені.",
      "mother_changes": "Збільшення частоти скорочень Брекстона-Гікса. Задишка через тиск на діафрагму. Болі у спині та тазу через розслаблення суглобів та збільшення ваги. Ніктурія (часте сечовипускання вночі) через тиск на сечовий міхур.",
      "nutrition_tips": "Вживайте продукти, багаті на вітамін D (збагачене молоко, яйця, жирна риба) для зміцнення кісток та імунної системи. Збільшіть споживання продуктів з цинком (м'ясо, морепродукти, горіхи) для підтримки розвитку імунної системи дитини.",
      "weight": "1.4-1.5 кг",
      "length": "41-42 см"
    },
    "32": {
      "size": {
        "fruit": "Кокос",
        "description": "Дитина майже повністю розвинена"
      },
      "baby_development": "Плід набирає вагу, формується імунна система, шкіра стає менш зморщеною. Нігті досягли кінчиків пальців. Молочні залози повністю сформовані у обох статей. Кістки повністю сформовані, але все ще м'які та гнучкі, щоб полегшити процес пологів.",
      "mother_changes": "Важко знайти зручне положення для сну, часте сечовипускання, біль у спині. Матка досягає нижнього краю грудної клітки. Можливий сильний свербіж шкіри через її розтягнення. Збільшення набряків, особливо у ногах.",
      "nutrition_tips": "Збалансоване харчування з достатньою кількістю кальцію і білка. Вживайте продукти, багаті на вітамін K (зелені листові овочі) для нормального згортання крові під час пологів. Включіть у раціон більше продуктів з низьким глікемічним індексом для стабілізації рівня цукру в крові.",
      "weight": "1.5-1.7 кг",
      "length": "40-42 см"
    },
    "33": {
      "size": {
        "fruit": "Ананас",
        "description": "Дитина продовжує набирати вагу"
      },
      "baby_development": "Мозок і легені продовжують дозрівати, дитина реагує на світло. Імунна система зміцнюється, отримуючи антитіла від матері. Плід практикує дихальні рухи, готуючись до самостійного дихання. Кишечник накопичує меконій - перші випорожнення новонародженого.",
      "mother_changes": "Збільшення втоми, тиск на діафрагму, задишка, набряки. Скорочення Брекстона-Гікса стають більш відчутними. Зниження рухливості через значний розмір живота. Можлива поява розтяжок на стегнах і сідницях.",
      "nutrition_tips": "Пийте більше води, уникайте надмірного споживання солі для зменшення набряків. Вживайте продукти, багаті на магній (горіхи, насіння, цільнозернові продукти) для зменшення судом м'язів. Включіть у раціон продукти з високим вмістом антиоксидантів для підтримки імунної системи.",
      "weight": "1.8-2.0 кг",
      "length": "42.5-43.5 см"
    },
    "34": {
      "size": {
        "fruit": "Диня канталупа",
        "description": "Шкіра дитини розгладжується завдяки підшкірному жиру"
      },
      "baby_development": "У плоду сформовані сурфактанти в легенях, які допоможуть легеням розкритися після народження. Нервова система та мозок продовжують розвиватися. Імунна система зміцнюється. Плід приймає положення для народження, часто головою вниз.",
      "mother_changes": "Можлива поява блискавичних болів у промежині через тиск головки плоду. Збільшення виділень з піхви, підготовка організму до пологів. Часті відвідування туалету через тиск на сечовий міхур. Збільшення метаболізму та відчуття жару.",
      "nutrition_tips": "Включіть у раціон більше кальцію (молочні продукти, збагачені рослинні напої, насіння чіа) для підтримки здоров'я кісток. Продовжуйте вживати продукти, багаті на залізо, для запобігання післяпологовій анемії. Забезпечте достатнє споживання вітаміну С для покращення засвоєння заліза.",
      "weight": "2.1-2.2 кг",
      "length": "44-45 см"
    },
    "35": {
      "size": {
        "fruit": "Гарбуз хоккайдо",
        "description": "Плід значно набрав вагу, шкіра більше не зморшкувата"
      },
      "baby_development": "Повністю сформовані нирки. Мозок продовжує активно розвиватися, формуються нові нейронні зв'язки. Продовжується накопичення підшкірного жиру. Плід може реагувати на світло, змінюючи частоту серцебиття. У хлопчиків яєчка спускаються в мошонку.",
      "mother_changes": "Зниження рухливості через великий розмір живота. Збільшення кількості скорочень Брекстона-Гікса. Можливе відчуття тиску внизу живота через опущення плоду. Збільшення болей у спині та тазовому поясі через розслаблення зв'язок.",
      "nutrition_tips": "Продовжуйте забезпечувати достатнє споживання білка для підтримки росту дитини. Вживайте більше продуктів, багатих на вітамін К, для нормального згортання крові. Забезпечте достатнє споживання рідини (не менше 2 літрів на день) для підтримки оптимального об'єму амніотичної рідини.",
      "weight": "2.3-2.4 кг",
      "length": "45-46 см"
    },
    "36": {
      "size": {
        "fruit": "Диня",
        "description": "Дитина майже готова до народження"
      },
      "baby_development": "Легені майже повністю розвинені, імунна система зміцнюється, набір ваги триває. Плід приймає положення для народження, зазвичай головою вниз. Практично вся головна система органів готова до життя поза маткою. Жировий шар під шкірою допомагає регулювати температуру тіла.",
      "mother_changes": "Опущення живота (лайтенінг), полегшення дихання, збільшення тиску на тазове дно. Підвищення тривожності перед пологами. Можливий біль у ділянці лобкового симфізу через розходження кісток тазу. Часті позиви до сечовипускання.",
      "nutrition_tips": "Їжте невеликими порціями, але часто, уникайте важкої їжі. Збагатіть раціон продуктами з цинком і селеном для підтримки імунної системи. Забезпечте достатнє споживання калію (банани, авокадо, картопля) для запобігання судомам м'язів.",
      "weight": "2.4-2.6 кг",
      "length": "45-47 см"
    },
    "37": {
      "size": {
        "fruit": "Гарбуз-спагеті",
        "description": "Дитина вважається доношеною при народженні"
      },
      "baby_development": "Плід вважається доношеним. Травна система готова до прийому молока. Легені повністю сформовані та здатні функціонувати поза маткою. Імунна система продовжує зміцнюватися за рахунок антитіл матері. Більшість плодів приймає положення головою вниз.",
      "mother_changes": "Відчуття тиску на таз і сечовий міхур через опущення плоду. Можлива поява рожевих виділень ('слизової пробки'). Збільшення гнучкості суглобів через дію гормону релаксину. Посилення болю у спині та тазу.",
      "nutrition_tips": "Забезпечте достатнє споживання заліза та кальцію для підготовки до пологів та лактації. Вживайте продукти з пробіотиками (йогурт, квашена капуста) для здорової мікрофлори кишечника. Продовжуйте регулярно пити воду для запобігання дегідратації.",
      "weight": "2.7-2.9 кг",
      "length": "47-48 см"
    },
    "38": {
      "size": {
        "fruit": "Гарбуз",
        "description": "Дитина повністю розвинена і готується до народження"
      },
      "baby_development": "Продовжується накопичення підшкірного жиру для регуляції температури тіла після народження. Легені виробляють достатню кількість сурфактанту для нормального дихання. Мозок продовжує розвиватися, формуючи нейронні зв'язки. Імунна система зміцнюється завдяки антитілам матері.",
      "mother_changes": "Часті позиви до дефекації через тиск голівки плоду на пряму кишку. Збільшення виділень з піхви як підготовка до пологів. Можливе посилення скорочень Брекстона-Гікса. Збільшення дискомфорту в спині та тазовому поясі.",
      "nutrition_tips": "Вживайте продукти, багаті на вітамін K, для запобігання післяпологовим кровотечам. Забезпечте достатнє споживання білка для підтримки росту тканин дитини та підготовки до лактації. Продовжуйте вживати продукти, багаті на залізо, для запобігання анемії.",
      "weight": "3.0-3.1 кг",
      "length": "48-49 см"
    },
    "39": {
      "size": {
        "fruit": "Кавун",
        "description": "Дитина повністю сформована і чекає моменту народження"
      },
      "baby_development": "Плід повністю готовий до життя поза маткою. Накопичено достатньо підшкірного жиру для терморегуляції. Травна система готова до прийому молока. Плід може мати до 1-2 см волосся на голові. Імунна система сильна завдяки антитілам матері.",
      "mother_changes": "Матка щільно прилягає до стінок тазу, готуючись до пологів. Можливе виділення слизової пробки або відходження навколоплідних вод. Підвищена втомлюваність і безсоння. Часті позиви до сечовипускання. Можливі прояви істинних перейм.",
      "nutrition_tips": "Продовжуйте балансоване харчування, забезпечуючи організм всіма необхідними поживними речовинами. Вживайте продукти, багаті на вітамін C, для зміцнення сполучних тканин та швидшого загоєння після пологів. Забезпечте достатнє споживання клітковини для запобігання запорам.",
      "weight": "3.1-3.3 кг",
      "length": "49-50 см"
    },
    "40": {
      "size": {
        "fruit": "Кавун",
        "description": "Дитина повністю готова до народження"
      },
      "baby_development": "Всі органи сформовані і функціонують, шар захисного жиру під шкірою забезпечує терморегуляцію. Імунна система зміцнена антитілами матері. Мозок продовжує розвиватися і буде рости протягом перших трьох років життя. Нігті на руках і ногах досягли кінчиків пальців.",
      "mother_changes": "Можливі передпологові перейми, відчуття тиску внизу живота, виділення слизової пробки. Збільшення частоти та інтенсивності скорочень матки. Можливе зниження апетиту. Підвищена втомлюваність та емоційна напруженість перед пологами.",
      "nutrition_tips": "Продовжуйте збалансоване харчування, звертайте увагу на сигнали тіла. Забезпечте достатнє споживання рідини для запобігання зневодненню під час пологів. Вживайте легкі, але енергетично цінні продукти для підтримки енергії під час пологів.",
      "weight": "3.2-3.5 кг",
      "length": "48-52 см"
    }
  }
}