{
  "weeks": {
    "1": {
      "size": {
        "fruit": "Насінина маку",
        "description": "Крихітна клітина, невидима неозброєним оком"
      },
      "baby_development": "Відбувається запліднення яйцеклітини і починається ділення клітин.",
      "mother_changes": "Ви можете не відчувати жодних змін, оскільки гормональні зміни ще не почалися.",
      "nutrition_tips": "Збалансоване харчування, багате фолієвою кислотою та залізом.",
      "weight": "менше 1 г",
      "length": "0.1-0.2 мм"
    },
    "2": {
      "size": {
        "fruit": "Насінина кунжуту",
        "description": "Дуже маленьке скупчення клітин"
      },
      "baby_development": "Ембріон імплантується в стінку матки і формується плацента.",
      "mother_changes": "Можливо відчуття втоми, нудоти, підвищена чутливість до запахів.",
      "nutrition_tips": "Пийте багато води, їжте невеликими порціями для запобігання нудоті.",
      "weight": "менше 1 г",
      "length": "0.2-0.3 мм"
    },
    "8": {
      "size": {
        "fruit": "Малина",
        "description": "Маленький ембріон вже з помітними зачатками органів"
      },
      "baby_development": "Формуються основні органи, розвиваються очі, вуха, серце почало битися.",
      "mother_changes": "Збільшення грудей, можливо ранкова нудота, втома, часте сечовипускання.",
      "nutrition_tips": "Збагатіть раціон білками, кальцієм і фолієвою кислотою.",
      "weight": "близько 1 г",
      "length": "1.6 см"
    },
    "12": {
      "size": {
        "fruit": "Лайм",
        "description": "Плід вже має чіткі людські обриси"
      },
      "baby_development": "Сформовані всі органи, починають рости нігті, плід може рухати кінцівками.",
      "mother_changes": "Зменшення нудоти, поява апетиту, невелике збільшення живота.",
      "nutrition_tips": "Включіть у раціон більше овочів і фруктів для отримання вітамінів.",
      "weight": "14-20 г",
      "length": "5-6 см"
    },
    "16": {
      "size": {
        "fruit": "Авокадо",
        "description": "Плід активно росте і розвивається"
      },
      "baby_development": "Формуються риси обличчя, шкіра стає менш прозорою, починають рости волосся.",
      "mother_changes": "Помітний живіт, можливо відчуття перших рухів дитини, збільшення енергії.",
      "nutrition_tips": "Збільшіть споживання білків і кальцію для розвитку м'язів і кісток дитини.",
      "weight": "100-120 г",
      "length": "10-12 см"
    },
    "20": {
      "size": {
        "fruit": "Банан",
        "description": "Плід активно рухається і реагує на звуки"
      },
      "baby_development": "Формуються смакові рецептори, вуха зайняли своє постійне положення, плід має періоди сну і активності.",
      "mother_changes": "Активні рухи дитини, збільшення живота, поява растяжок.",
      "nutrition_tips": "Збільшіть споживання омега-3 жирних кислот для розвитку мозку дитини.",
      "weight": "250-300 г",
      "length": "16-18 см"
    },
    "24": {
      "size": {
        "fruit": "Кукурудза",
        "description": "Тіло дитини наповнюється і формуються пропорції"
      },
      "baby_development": "Легені готуються до дихання, плід має періоди активності і спокою, може чути голос мами.",
      "mother_changes": "Збільшення ваги, біль у спині, набряки ніг, болі в животі від розтягнення м'язів.",
      "nutrition_tips": "Споживайте достатню кількість заліза, щоб запобігти анемії.",
      "weight": "550-600 г",
      "length": "28-30 см"
    },
    "28": {
      "size": {
        "fruit": "Баклажан",
        "description": "Плід активно набирає вагу"
      },
      "baby_development": "Відкриваються очі, розвивається мозок, легені продовжують розвиватись.",
      "mother_changes": "Задишка, печія, набряки, можливі болі в тазу.",
      "nutrition_tips": "Включіть у раціон продукти, багаті вітаміном D і магнієм.",
      "weight": "900-1000 г",
      "length": "35-37 см"
    },
    "32": {
      "size": {
        "fruit": "Кокос",
        "description": "Дитина майже повністю розвинена"
      },
      "baby_development": "Плід набирає вагу, формується імунна система, шкіра стає менш зморщеною.",
      "mother_changes": "Важко знайти зручне положення для сну, часте сечовипускання, біль у спині.",
      "nutrition_tips": "Збалансоване харчування з достатньою кількістю кальцію і білка.",
      "weight": "1.5-1.7 кг",
      "length": "40-42 см"
    },
    "33": {
      "size": {
        "fruit": "Салат-латук",
        "description": "Дитина продовжує набирати вагу"
      },
      "baby_development": "Мозок і легені продовжують дозрівати, дитина реагує на світло.",
      "mother_changes": "Збільшення втоми, тиск на діафрагму, задишка, набряки.",
      "nutrition_tips": "Пийте більше води, уникайте надмірного споживання солі для зменшення набряків.",
      "weight": "1.8-2.0 кг",
      "length": "42.5-43.5 см"
    },
    "36": {
      "size": {
        "fruit": "Диня",
        "description": "Дитина майже готова до народження"
      },
      "baby_development": "Легені майже повністю розвинені, імунна система зміцнюється, набір ваги триває.",
      "mother_changes": "Опущення живота, полегшення дихання, збільшення тиску на тазове дно.",
      "nutrition_tips": "Їжте невеликими порціями, але часто, уникайте важкої їжі.",
      "weight": "2.4-2.6 кг",
      "length": "45-47 см"
    },
    "40": {
      "size": {
        "fruit": "Кавун",
        "description": "Дитина повністю готова до народження"
      },
      "baby_development": "Всі органи сформовані і функціонують, шар захисного жиру під шкірою забезпечує терморегуляцію.",
      "mother_changes": "Можливі передпологові перейми, відчуття тиску внизу живота, виділення слизової пробки.",
      "nutrition_tips": "Продовжуйте збалансоване харчування, звертайте увагу на сигнали тіла.",
      "weight": "3.2-3.5 кг",
      "length": "48-52 см"
    }
  }
} 